### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.backend_func.module.cdc_backend_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          ~ "ALGORITHM_ENCRYPTION"                                                                             = (sensitive value)
          ~ "ALGORITHM_KEYS"                                                                                   = (sensitive value)
          ~ "ALGORITHM_SIGNATURE"                                                                              = (sensitive value)
          ~ "AUDIT_LOG_CONNECTION_STRING"                                                                      = (sensitive value)
          ~ "AUDIT_LOG_CONTAINER"                                                                              = (sensitive value)
          ~ "CARD_REQUEST_QUEUE_NAME"                                                                          = (sensitive value)
          ~ "CDC_API_BASE_URL"                                                                                 = (sensitive value)
          ~ "CDC_API_BASE_URL_TEST"                                                                            = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "CDC_BASE_URL"                                                                                     = (sensitive value)
          ~ "COSMOSDB_CDC_DATABASE_NAME"                                                                       = (sensitive value)
          ~ "COSMOSDB_CDC_KEY"                                                                                 = (sensitive value)
          ~ "ENCODING_ENCRYPTION"                                                                              = (sensitive value)
          ~ "ENCRYPTION_PUBLIC_KEY"                                                                            = (sensitive value)
          ~ "ENCRYPTION_PUBLIC_KEY_TEST"                                                                       = (sensitive value)
          ~ "FIMS_CLIENT_ID"                                                                                   = (sensitive value)
          ~ "FIMS_CLIENT_SECRET"                                                                               = (sensitive value)
          ~ "FIMS_ISSUER_URL"                                                                                  = (sensitive value)
          ~ "FIMS_REDIRECT_URL"                                                                                = (sensitive value)
          ~ "FIMS_SCOPE"                                                                                       = (sensitive value)
          ~ "JWT_AUDIENCE"                                                                                     = (sensitive value)
          ~ "JWT_EXPIRATION"                                                                                   = (sensitive value)
          ~ "JWT_ISSUER"                                                                                       = (sensitive value)
          ~ "JWT_PRIVATE_KEY"                                                                                  = (sensitive value)
          ~ "JWT_PRIVATE_KEY_TEST"                                                                             = (sensitive value)
          ~ "PAGOPA_IDP_KEYS_BASE_URL"                                                                         = (sensitive value)
          ~ "SERVICES_API_KEY"                                                                                 = (sensitive value)
          ~ "SERVICES_API_URL"                                                                                 = (sensitive value)
          ~ "STORAGE_ACCOUNT__queueServiceUri"                                                                 = (sensitive value)
          ~ "TEST_USERS"                                                                                       = (sensitive value)
            # (35 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Web/sites/io-p-itn-cdc-backend-func-01"
        name                                           = "io-p-itn-cdc-backend-func-01"
        tags                                           = {
            "BusinessUnit"                                   = "CDC"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CDC"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "[REDACTED]"
            "hidden-link: /app-insights-instrumentation-key" = "[REDACTED]"
            "hidden-link: /app-insights-resource-id"         = "[REDACTED]"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.backend_func.module.cdc_backend_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "ALGORITHM_ENCRYPTION"                                                                             = (sensitive value)
          ~ "ALGORITHM_KEYS"                                                                                   = (sensitive value)
          ~ "ALGORITHM_SIGNATURE"                                                                              = (sensitive value)
          ~ "AUDIT_LOG_CONNECTION_STRING"                                                                      = (sensitive value)
          ~ "AUDIT_LOG_CONTAINER"                                                                              = (sensitive value)
          ~ "CARD_REQUEST_QUEUE_NAME"                                                                          = (sensitive value)
          ~ "CDC_API_BASE_URL"                                                                                 = (sensitive value)
          ~ "CDC_API_BASE_URL_TEST"                                                                            = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "CDC_BASE_URL"                                                                                     = (sensitive value)
          ~ "COSMOSDB_CDC_DATABASE_NAME"                                                                       = (sensitive value)
          ~ "COSMOSDB_CDC_KEY"                                                                                 = (sensitive value)
          ~ "ENCODING_ENCRYPTION"                                                                              = (sensitive value)
          ~ "ENCRYPTION_PUBLIC_KEY"                                                                            = (sensitive value)
          ~ "ENCRYPTION_PUBLIC_KEY_TEST"                                                                       = (sensitive value)
          ~ "FIMS_CLIENT_ID"                                                                                   = (sensitive value)
          ~ "FIMS_CLIENT_SECRET"                                                                               = (sensitive value)
          ~ "FIMS_ISSUER_URL"                                                                                  = (sensitive value)
          ~ "FIMS_REDIRECT_URL"                                                                                = (sensitive value)
          ~ "FIMS_SCOPE"                                                                                       = (sensitive value)
          ~ "JWT_AUDIENCE"                                                                                     = (sensitive value)
          ~ "JWT_EXPIRATION"                                                                                   = (sensitive value)
          ~ "JWT_ISSUER"                                                                                       = (sensitive value)
          ~ "JWT_PRIVATE_KEY"                                                                                  = (sensitive value)
          ~ "JWT_PRIVATE_KEY_TEST"                                                                             = (sensitive value)
          ~ "PAGOPA_IDP_KEYS_BASE_URL"                                                                         = (sensitive value)
          ~ "SERVICES_API_KEY"                                                                                 = (sensitive value)
          ~ "SERVICES_API_URL"                                                                                 = (sensitive value)
          ~ "STORAGE_ACCOUNT__queueServiceUri"                                                                 = (sensitive value)
          ~ "TEST_USERS"                                                                                       = (sensitive value)
            # (36 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Web/sites/io-p-itn-cdc-backend-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                                   = "CDC"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CDC"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "[REDACTED]"
            "hidden-link: /app-insights-instrumentation-key" = "[REDACTED]"
            "hidden-link: /app-insights-resource-id"         = "[REDACTED]"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.roles.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-cdc-rg-01|io-p-itn-cdc-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Allow CDC Backend Function to read secrets from Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d3711370-e4ac-42c3-badc-869df40f6157"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-cdc-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.support_func.module.cdc_support_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          ~ "ALGORITHM_ENCRYPTION"                                                                             = (sensitive value)
          ~ "ALGORITHM_KEYS"                                                                                   = (sensitive value)
          ~ "ALGORITHM_SIGNATURE"                                                                              = (sensitive value)
          ~ "CDC_API_BASE_URL"                                                                                 = (sensitive value)
          ~ "CDC_API_BASE_URL_TEST"                                                                            = (sensitive value)
          ~ "COSMOSDB_CDC_DATABASE_NAME"                                                                       = (sensitive value)
          ~ "COSMOSDB_CDC_KEY"                                                                                 = (sensitive value)
          ~ "ENCODING_ENCRYPTION"                                                                              = (sensitive value)
          ~ "ENCRYPTION_PUBLIC_KEY"                                                                            = (sensitive value)
          ~ "ENCRYPTION_PUBLIC_KEY_TEST"                                                                       = (sensitive value)
          ~ "JWT_AUDIENCE"                                                                                     = (sensitive value)
          ~ "JWT_EXPIRATION"                                                                                   = (sensitive value)
          ~ "JWT_ISSUER"                                                                                       = (sensitive value)
          ~ "JWT_PRIVATE_KEY"                                                                                  = (sensitive value)
          ~ "JWT_PRIVATE_KEY_TEST"                                                                             = (sensitive value)
          ~ "TEST_USERS"                                                                                       = (sensitive value)
            # (24 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Web/sites/io-p-itn-cdc-support-func-01"
        name                                           = "io-p-itn-cdc-support-func-01"
        tags                                           = {
            "BusinessUnit"                           = "CDC"
            "CostCenter"                             = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO CDC"
            "Owner"                                  = "IO"
            "Source"                                 = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.support_func.module.cdc_support_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "ALGORITHM_ENCRYPTION"                                                                             = (sensitive value)
          ~ "ALGORITHM_KEYS"                                                                                   = (sensitive value)
          ~ "ALGORITHM_SIGNATURE"                                                                              = (sensitive value)
          ~ "CDC_API_BASE_URL"                                                                                 = (sensitive value)
          ~ "CDC_API_BASE_URL_TEST"                                                                            = (sensitive value)
          ~ "COSMOSDB_CDC_DATABASE_NAME"                                                                       = (sensitive value)
          ~ "COSMOSDB_CDC_KEY"                                                                                 = (sensitive value)
          ~ "ENCODING_ENCRYPTION"                                                                              = (sensitive value)
          ~ "ENCRYPTION_PUBLIC_KEY"                                                                            = (sensitive value)
          ~ "ENCRYPTION_PUBLIC_KEY_TEST"                                                                       = (sensitive value)
          ~ "JWT_AUDIENCE"                                                                                     = (sensitive value)
          ~ "JWT_EXPIRATION"                                                                                   = (sensitive value)
          ~ "JWT_ISSUER"                                                                                       = (sensitive value)
          ~ "JWT_PRIVATE_KEY"                                                                                  = (sensitive value)
          ~ "JWT_PRIVATE_KEY_TEST"                                                                             = (sensitive value)
          ~ "TEST_USERS"                                                                                       = (sensitive value)
            # (25 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Web/sites/io-p-itn-cdc-support-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                           = "CDC"
            "CostCenter"                             = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO CDC"
            "Owner"                                  = "IO"
            "Source"                                 = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.support_func_roles.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-cdc-rg-01|io-p-itn-cdc-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Allow Support Function to read secrets from Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6ffcdf4a-1d1d-4975-932f-94bb36a9f1a8"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-cdc-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 4 to change, 0 to destroy.

Warning: Argument is deprecated

  with azurerm_monitor_diagnostic_setting.queue_diagnostic_setting,
  on cdc_alerts.tf line 401, in resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting":
 401: resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting" {

`metric` has been deprecated in favor of the `enabled_metric` property and
will be removed in v5.0 of the AzureRM provider

(and 5 more similar warnings elsewhere)
```

</details>
